[
  {
    "id": 1,
    "title": "Can Bellingham make El Clasico statement with English sub-plot?",
    "description": "The 22-year-old midfielder has had a difficult start to the campaign after injury and growing questions around his place in England's World Cup squad. But, as he prepares for Sunday's El Clasico against Barcelona, the former Birmingham City man will be determined to prove to everyone - including Three Lions boss Thomas Tuchel - he is still England's leading man in La Liga. It is set to be the first El Clasico to feature two English players in opposition, with Barcelona's in-form forward Marcus Rashford set to face Bellingham. The involvement of a third - Real full-back Trent Alexander-Arnold - is unlikely because of injury, as Madrid look to stretch their two-point lead at the top over their bitter rivals. For Bellingham, an El Clasico provides the perfect stage to make a statement.The defining fixture of Spanish football, there will be more than 80,000 fans packed inside the Bernabeu - the majority being passionate Madridistas. And Bellingham will know Tuchel's eyes and the eyes of more than 650 million viewers will also be on him.",
    "category": "sport",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-10-25",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/267e/live/274f0350-b02a-11f0-a375-75de819286d1.jpg.webp"
  },
  {
    "id": 2,
    "title": "A glimpse of the future? Liverpool 'near perfect' despite Isak injury",
    "description": "It was a night of bold calls for Liverpool boss Arne Slot in the Champions League on Wednesday, particularly on the back of four successive losses. With the Reds out of form and desperate for a win, Slot opted to bench the talismanic Mohamed Salah against Eintracht Frankfurt and also experiment with a change in formation. The most interesting aspect of that change was the decision to start British record signing Alexander Isak alongside the in-form Huge Ekitike for the first time. All the risks paid off as Liverpool emphatically beat their German opponents 5-1, with Ekitike scoring against the club he left in the summer to make the move to Merseyside. However it did come at a cost, with Isak not emerging for the second half after suffering a groin injury. 'He had to go off at half-time because he felt his groin a little bit,' Slot told TNT Sports afterwards. 'That is a pity but it is such a difficult balance to find with a player who missed out three months.' 'You bring them slowly and sometimes people argue saying 'you cannot play him more or longer' and now we've played him for the second time in three days and unfortunately he had to go off.' 'Let's hope for the best.' In an additional injury blow, right-back Jeremie Frimpong went off in the first half with a hamstring injury and will be out for a 'few weeks', according to Slot.",
    "category": "sport",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-10-22",
    "image": "https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/627c/live/e6abafb0-af93-11f0-9cc2-49df03af328d.jpg.webp"
  },
  {
    "id": 3,
    "title": "43 goals, five reds, six penalties - one blockbuster evening",
    "description": "There were 43 goals scored, five red cards handed out and six penalties awarded - of which five were converted. It was a relentless evening of Champions League football on Tuesday. Last season's winners Paris St-Germain hit seven past Leverkusen, with both teams having a player sent off and the German side's Alejandro Grimaldo missing a spot-kick. PSV Eindhoven fought back from a goal down before running riot in a 6-2 win against Italian champions Napoli. Arsenal, Newcastle and Manchester City all claimed convincing victories, with City's Erling Haaland scoring for a 12th consecutive game. There were goals and drama aplenty, so BBC Sport has dived into the stats behind an entertaining night in Europe's most prestigious club tournament.",
    "category": "sport",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-10-22",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6b30/live/7abe23b0-aecf-11f0-b7ea-f340cf3fb5b2.jpg.webp"
  },
  {
    "id": 4,
    "title": "How Newcastle's other forwards stepped up in Champions League",
    "description": "Even Jose Mourinho could not help but throw an arm around Anthony Gordon at full-time. The Benfica manager had just watched the forward put in a man-of-the-match display in Newcastle's 3-0 win against his side at St James' Park. The Champions League is a stage Gordon clearly relishes - and he is not the only one. Only the bottom three have scored fewer goals in the Premier League this season than Newcastle, who have seven. Yet it has been a very different story in Europe. Newcastle have already netted eight goals in just three games in the Champions League. This was a night where Eddie Howe's side had 19 efforts, 10 shots on target and 38 touches in the opposition box. A potentially awkward opponent ended up being swept aside - but Howe stressed there is 'much more to come'. 'We're seeing the early shoots of the new team and it's exciting what we can be,' he said. 'But a lot of hard work ahead.'",
    "category": "sport",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-10-22",
    "image": "https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/89bc/live/ba1adf10-aecc-11f0-8985-478e3711028a.jpg.webp"
  },
  {
    "id": 5,
    "title": "Wales face up to challenge of life after Fishlock",
    "description": "The end of one era heralds the dawning of the next. For Wales, life after Jess Fishlock starts with a friendly against Poland in Newport on Tuesday.And there begins the challenge of filling the void left by Fishlock's international retirement, of rebuilding following the removal of the cornerstone of the Wales team. Fishlock has been part of the national squad for almost two decades, and has played in more than two-thirds of the games in the history of Wales' women's football team. Even with her 39th birthday on the horizon, she remains Wales' standout player - or at least she did until she said her goodbyes at the Cardiff City Stadium on Saturday. Rhian Wilkinson is the head coach tasked with managing without Fishlock, of ensuring Wales continue their path of progression without their iconic number 10. Wilkinson insists it would be a 'waste of energy' to try to fill the void left by Fishlock's international retirement.'You don't do that. It's impossible and it's not fair to the player [who comes in],' Wilkinson said.",
    "category": "sport",
    "author": "Paul Hosford",
    "publishedDate": "2025-10-26",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6371/live/e75af950-b242-11f0-aa13-0b0479f6f42a.jpg.webp"
  },
  {
    "id": 6,
    "title": "Xabi Alonso is the fifth coach in Real Madrid's history to start with three wins in the Champions League.",
    "description": "Real Madrid head coach Xabi Alonso has joined the ranks of coaches who have started with three wins in the Champions League with the Madrid club. According to Opta, Jupp Heynckes, Carlos Queiroz, José Mourinho, and Carlo Ancelotti have previously achieved this feat. At the start of the current tournament, Real Madrid won consecutive victories over Marseille (2-1), Kairat (5-0), and Juventus (1-0).",
    "category": "sport",
    "author": "Paul Hosford",
    "publishedDate": "2025-10-23",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/267e/live/274f0350-b02a-11f0-a375-75de819286d1.jpg.webp"
  },
  {
    "id": 7,
    "title": "The NBA is at its international peak, but British players are still struggling to break through",
    "description": "The NBA is being hit by an international storm, attracting athletes from all corners of the world. At the start of the 2024-25 season, the league announced that a record-tying 125 international players were on opening night rosters. Those 125 players came from 43 countries, including Australia, Germany, France, Cameroon and Serbia. Fast-forward to the 2025 NBA draft. Behind the flashing lights and celebratory fireworks surrounding top prospects Cooper Flagg, Dylan Harper and Ace Bailey was an underappreciated, perhaps even more compelling story of an international player waiting for his big chance. As social media buzzed through the first round and beyond, Amari Williams waited patiently in the wings. The former University of Kentucky center from Great Britain, far removed from the bright lights, wasn’t your standard international draftee story. So when he was selected by the 18-time NBA champion Boston Celtics midway through the second round, it was more than just a personal triumph – it was a win for British basketball on the world’s biggest stage.",
    "category": "sport",
    "author": "Hong Yoo",
    "publishedDate": "2025-10-20",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap25277632899880.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 8,
    "title": "Feds reveal mafia-linked gambling probe that led to arrests of Hall of Famer Chauncey Billups and NBA star Terry Rozier",
    "description": "Portland Trail Blazers head coach and basketball Hall of Famer Chauncey Billups, Miami Heat guard Terry Rozier and former NBA journeyman Damon Jones are among 34 people indicted in connection with two separate federal gambling investigations announced by the Eastern District of New York on Thursday. At a lengthy and at times spirited news conference that included FBI Director Kash Patel, US Attorney Joseph Nocella Jr., and others detailed the sweeping multi-year investigations that spanned 11 states, resulted in the arrests of 34 people, involved tens of millions of dollars and included members of the notorious Bonanno, Genovese, Gambino and Luchese crime families. Billups, who coached in the Trail Blazers’ opening game on Wednesday night, was arrested in Portland on Thursday morning and is expected to appear in federal court there later on Thursday. Rozier, arrested in Orlando, will appear there. Both will be arraigned at a later date in Brooklyn. Jones, who retired in 2012, is one of three people to be charged in both cases.“My message to the defendants who have been rounded up today is this: Your winning streak has ended, ’’ Nocella said. “Your luck has run out. Violating the law is a losing proposition, and you can bet on that.’’ Billups, the Portland head coach since 2021, is charged in an elaborate scheme in which marks were lured to participate in rigged poker games in part with the opportunity to play alongside the NBA five-time All-Star as well as Jones.",
    "category": "sport",
    "author": "Hong Yoo",
    "publishedDate": "2025-10-24",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2191911089.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 9,
    "title": "NBA Opening Night: OKC wins double-OT thriller against Rockets as they receive championship rings, Warriors topple Lakers",
    "description": "The NBA is back for another intriguing season and it began in emphatic fashion on Tuesday night. On an evening which began with the celebration of the Oklahoma City Thunder’s title victory – with players receiving their championship rings and a banner being raised to the rafters of Paycom Center – fans were treated to two exciting games. First, the Thunder played a double-overtime thriller against the new-look Houston Rockets, holding on to win 125-124 in an instant classic. And in California, the LeBron James-less Los Angeles Lakers lost their home opener 119-109 to the Golden State Warriors. Here’s everything you need to know about the two opening games of the 2025 NBA season.",
    "category": "sport",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-22",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2242107372.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 10,
    "title": "Golfer saves par and ‘both hands’ in close encounter with alligator",
    "description": "Reuters —  American golfer Vince Whaley had a particularly nerve-wracking encounter with a big-toothed onlooker at the Sanderson Farms Championship on Sunday, as he was forced to play a shot under the watchful gaze of a lurking alligator. Whaley rolled up his trousers and waded into ankle-deep water after a wayward shot during the final round of the tournament, only to discover he had some unwanted company. An alligator’s head could be seen poking out of the water just a few feet away as Whaley prepared to take his shot, but the 30-year-old quickly brought the ball back onto dry land and escaped with par on the 11th green.",
    "category": "sport",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-06",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2239401052.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 11,
    "title": "Fans insulting players is not ‘the way forward’ at the Ryder Cup, says victorious Europe player Tyrrell Hatton",
    "description": "English golfer Tyrrell Hatton has underlined that insults are not “the way forward” when it comes to fan behavior at the Ryder Cup, several days after his victory with Team Europe. The language used by American fans towards European players at Bethpage Black became a flashpoint during last weekend’s tournament, which Europe won 15-13 after staving off a dramatic US fightback on Sunday. Players were subjected to verbal abuse and personal insults while on the course in Farmingdale, New York, with European talisman Rory McIlroy saying that “a lot of the language was unacceptable.” That also extended to the players’ families, with Irishman Shane Lowry adding that McIlroy’s wife, Erica, had received an “astonishing” amount of abuse.",
    "category": "sport",
    "author": "Joshua Mbu",
    "publishedDate": "2025-10-02",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2238140805.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 12,
    "title": "Amanda Anisimova holds off Linda Nosková to claim China Open title",
    "description": "Two-time grand slam finalist Amanda Anisimova claimed the China Open women’s title on Sunday with a 6-0, 2-6, 6-2 win over Czech player Linda Nosková. Anisimova, runner-up at Wimbledon and the US Open in 2025, claimed victory in Beijing despite Nosková posing a significant challenge in the second set. It was a challenge that arrived duly, as Nosková won just 12 points in a 23-minute opening set. Anisimova looked well on her way to claiming victory to continue what has been a brilliant year for the American. But Nosková, competing in her first WTA 1000 event, fought back admirably in the second set. The 20-year-old crucially broke Anisimova’s serve in the opening game of the second set after asserting more aggressive play.",
    "category": "sport",
    "author": "Joshua Mbu",
    "publishedDate": "2025-10-06",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap25279317218239.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 13,
    "title": "Champion runner Caster Semenya ending legal fight against sex eligibility rules, lawyer tells AP",
    "description": "Cape Town, South Africa (AP) —  Olympic champion runner Caster Semenya is ending a seven-year legal challenge against sex eligibility rules in track and field, her lawyers said Thursday, despite winning a ruling at the European Court of Human Rights in July that appeared to have reignited one of sports’ most contentious cases. Patrick Bracher, a lawyer for Semenya, said in an email to The Associated Press that they wouldn’t take her appeal back to the Swiss supreme court, which was an option and what many presumed to be Semenya’s next step after the European rights court ruling.",
    "category": "sport",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-10-03",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap22201859916360.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 14,
    "title": "American Cole Hocker rebounds from ‘robbed’ 1500m disqualification to clinch men’s 5000m world title",
    "description": "American runner Cole Hocker soared through the pack to clinch gold in the men’s 5000m at the World Athletics Championships on Sunday, bouncing back from a painful disqualification in the 1500m event. The 24-year-old made a late surge at a rain-soaked National Stadium in Tokyo, Japan to finish in 12:58.30, ahead of Belgium’s Isaac Kimeli and France’s Jimmy Gressier in 12:58.78 and 12:59.33, respectively. It crowned Hocker as just the second American to win a 5000m world title, after Bernard Lagat’s 2007 triumph in Osaka, and sealed a cathartic triumph after his hopes of adding to his Olympic 1500m gold were dashed. Hocker’s win in Paris last year was among the Games’ biggest upsets but his place in the World Championship final was lost after he was deemed to have broken the competition’s “jostling” rules in Monday’s semifinal. The University of Oregon alumnus was adjudged to have erred while moving through a gap between Germany’s Robert Farken and Stefan Nillessen late in the heat, with an appeal by USA Track & Field denied.",
    "category": "sport",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-09-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2236545960.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 15,
    "title": "Two brothers, one title dream – MotoGP’s high stakes sibling rivalry",
    "description": "World class sporting siblings may not be unheard of, but with the notable exception of Serena and Venus Williams in tennis, they are rarely in direct competition for the same big prize. Rarer still is a story with as many twists and turns as that of Marc and Álex Márquez, two brothers from the tiny town of Cervera in Spain’s northeastern region of Catalonia. Currently lying first and second in the MotoGP standings, they are vying for a world title at speeds of over 220 mph (354 kph) as the Formula One of motorcycle racing approaches the halfway point of the season.",
    "category": "sport",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-07-11",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213974028.jpg?c=16x9&q=h_653,w_1160,c_fill/f_avif"
  },
  {
    "id": 16,
    "title": "Lewis Hamilton ‘so sad’ after hitting groundhog during Canadian Grand Prix as George Russell claims win",
    "description": "When seven-time world champion Lewis Hamilton suffered damage to his car during the Canadian Grand Prix on Sunday, the cause wasn’t initially clear. The Ferrari driver, who had started fifth on the grid, knew something had happened after suddenly losing pace early in the race but was only later told that he had hit a groundhog. The impact with the animal had damaged the floor of Hamilton’s car which cost the 40-year-old around half a second per lap, resulting in a sixth placed finish. But speaking after the race, Hamilton – a vegan and animal rights activist – appeared more upset by the collision than the result. “I didn’t see it happen, but I heard I hit a groundhog, so that’s devastating,” he told Sky Sports. “I love animals, so I’m so sad about it. It’s horrible. It’s never happened to me here before.” Groundhogs are common at the Circuit Gilles Villeneuve in Montreal, but it was nevertheless frustrating for Hamilton who ended up nowhere near the front of the race. Instead, it was a lonely Grand Prix for the Ferrari driver who also suffered problems with the car’s brakes.",
    "category": "sport",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-06-16",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2220289900.jpg?c=16x9&q=h_653,w_1160,c_fill/f_avif"
  },
  {
    "id": 17,
    "title": "Motorsport’s world governing body dials back driver cursing penalties after major outcry",
    "description": "The FIA, motorsport’s world governing body, announced on Wednesday a major dialing back of the penalties issued to drivers for cursing after a groundswell of opposition towards the new regulations. In rules introduced by the FIA ahead of the season, F1 drivers could be penalized – with monetary fines or loss of championship points – for cursing in press conferences.Fines started at €40,000 ($41,600) for a driver’s first offense, with it doubling for a second breach of the rules as well as a suspended one-month ban. A third offense would potentially bring about a €120,000 ($125,000) fine, a one-month ban and the loss of championship points. But the FIA scaled back those regulations on Wednesday after continued complaints from high-level F1 drivers. Following the amendment of Appendix B in FIA International Sporting Code, the base maximum penalties for drivers will be reduced generally from €10,000 ($11,210) to €5,000 ($5,600) – a reduction of 50% – although “for FIA World Championships, where multipliers were involved, the reductions will be even more significant,” the governing body said. The FIA also said that stewards can suspend a penalty in certain cases if it’s a first offense by a driver or team. Stewards will also be permitted to adjudge whether language was used in “controlled” or “uncontrolled” environments to assess whether a penalty is deemed necessary – a “controlled” environment is defined as a press conferences and an “uncontrolled” environment is a “spontaneous comments made by drivers or teams when on track or during a rally stage.” The new guidelines also state that “abuse of officials will now result in sporting penalties rather than fines, aligning motor sport with other major global sports organizations.”",
    "category": "sport",
    "author": "Rico Osmena",
    "publishedDate": "2025-05-15",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1790170440.jpg?c=16x9&q=h_653,w_1160,c_fill/f_avif"
  },
  {
    "id": 18,
    "title": "American climber Balin Miller dies aged 23 while climbing El Capitan",
    "description": "American climber Balin Miller has died at the age of 23 while climbing at Yosemite National Park, his mother confirmed on Thursday. Miller was attempting to summit El Capitan, Yosemite’s iconic wall soaring 3,000 feet from the valley floor, via the “Sea of Dreams” route when the accident occurred, Jeanine Moorman – Miller’s mother – wrote in a blog post on the VIRR website, the family’s outdoor goods business. “This is unthinkable,” Moorman wrote in tribute to her son. “At this time, we do not yet know all the details. What we do know is that the world has lost an extraordinary soul, and our hearts are shattered.” Moorman went on to describe her son as having “a touch of Robin Williams’ wild energy. Strategic, curious, and endlessly playful, he brought light wherever he went.” El Capitan is a popular destination for big-wall climbers, best known as the site of Alex Honnold’s Oscar-winning “Free Solo” documentary, during which Honnold scaled the rock face without ropes. Miller had been hoping to lead a route at some point in Yosemite, Moorman said, having recently completed an ice and alpine climbing trip in his home state of Alaska. A popular figure in the climbing community, Miller would live stream some of his climbs on TikTok and was affectionately known as “orange tent guy” due to his eye-catching camping equipment.",
    "category": "sport",
    "author": "Rico Osmena",
    "publishedDate": "2025-10-03",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap25275776870064.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 19,
    "title": "From highs to lows, Everest record breaker sees ‘no future’ in Nepal",
    "description": "Kami Rita Sherpa had stood at the top of the world just days earlier, exultant at having summited Mount Everest for a record 28th time. The Nepali climber was given a hero’s welcome on his return to Kathmandu, but all that joy appeared to have deserted him as he surveyed life’s highs and lows from an armchair in the small, neat living room of his rented apartment, while his wife poured tea. “There is no future in Nepal,” the 53-year-old father of two told Reuters over the weekend. “Why stay here?” he asked, speaking in his native Nepali and a smattering of broken English. “We need a future for ourselves… for our children.” Wearing a baseball cap bearing the legend “Everest Man”, and his face blackened by wind and snow burns, Kami Rita is clearly proud of his achievements. But he is also grateful that money he made as a guide with mountain expeditions helped him move to Nepal’s capital so that his children could have the education he never received. His son, 24, is studying tourism and his daughter, 22, is doing an Information Technology course. “This would not have been possible had I continued to stay at Thame and not taken to climbing,” said Kami Rita, who left school in his mountain village when he was around 12 years old. Awards and Guinness World Record certificates fill the showcase behind him, and posters of Kami Rita on Mount Everest adorn the walls, but he talked of immigrating to the United States to find new opportunities for his family.",
    "category": "sport",
    "author": "Rico Osmena",
    "publishedDate": "2023-05-30",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/230530111610-01-kami-rita-sherpa-future.jpg?c=16x9&q=h_653,w_1160,c_fill/f_avif"
  },
  {
    "id": 20,
    "title": "Yamamoto’s masterful outing leads Dodgers to Game 2 win over Blue Jays to even up World Series",
    "description": "The Los Angeles Dodgers bounced back from a disappointing start to the World Series to take Game 2 over the Toronto Blue Jays 5-1 on Saturday night at the Rogers Centre. Starter Yoshinobu Yamamoto yet again pitched a complete game, retiring the final 20 batters he faced as the Dodgers tied up the series at 1-1.The 27-year-old struck out nine batters, giving up one earned run on four hits allowed. It was Yamamoto’s second consecutive complete game in the postseason, becoming the first Dodgers pitcher to do so since Orel Hershiser in 1988, according to the Fox broadcast.Just like on Friday, the Dodgers got the scoring started early after catcher Will Smith hit an RBI single to score Freddie Freeman and take a 1-0 lead. But Jays starter Kevin Gausman was able regain control after a rocky first inning, with Toronto eventually tying the game at 1-1 following an Alejandro Kirk sacrifice fly in the third inning. Gausman had retired 17 straight Dodger batters until the seventh inning, when Smith yet again got the best of him, hitting a solo home run to break the stale mate. And Los Angeles did not stop there. After getting Teoscar Hernandez to strike out, Gausman gave up another solo shot — this time to Max Muncy as the Dodgers extended their lead and knocked the 34-year-old out of the game. It was the first postseason game in MLB history where two pitchers retired 17 or more consecutive batters, according to the Elias Sports Bureau. The Dodgers tacked on two more runs in the eighth inning before Yamamoto was able to close things out.",
    "category": "sport",
    "author": "Oliver Caffrey",
    "publishedDate": "2025-10-26",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap25299064301174.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 21,
    "title": "How a tiny bug spiraled into a massive outage that took down the internet",
    "description": "A massive AWS outage Monday that brought down some of the world’s most popular apps and services all started with a glitch. The bug – which occurred when two automated systems were trying to update the same data simultaneously – snowballed into something significantly more serious that Amazon’s engineers scrambled to fix, the company said Thursday in a postmortem assessment. The massive cloud service’s outage meant people couldn’t order food, communicate with hospital networks, access mobile banking, or connect with their security systems and smart home devices. Major global companies, including Netflix, Starbucks and United Airlines, were temporarily unable to give customers access to their online services. “We apologize for the impact this event caused our customers,” Amazon said in a statement on the AWS website. “We know this event impacted many customers in significant ways. We will do everything we can to learn from this event and use it to improve our availability even further.”",
    "category": "technology",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-10-25",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2166701641.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 22,
    "title": "Amazon says systems are back online after global internet outage",
    "description": "Amazon says its systems are effectively back online Amazon Monday afternoon said that its systems are mostly back online after a massive Amazon Web Services (AWS) cloud services outage brought down thousands of high-profile apps, websites and online platforms with it. “We continue to observe recovery across all AWS services,” the company said. One Amazon product, Lambda, continued to return errors, but the company said the company is bringing that service back online. Lambda lets customers write new code for their products and platforms, and the service will automatically manage the infrastructure needed to deploy the code.",
    "category": "technology",
    "author": "Tatjana Orechova",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-04-22t132900z-283854644-rc2pb7aewxc2-rtrmadp-3-germany-industry-hanover.JPG?c=16x9&q=h_438,w_780,c_fill"
  },
  {
    "id": 23,
    "title": "OpenAI’s Sora bans Martin Luther King Jr. deepfakes after his family complained",
    "description": "OpenAI announced that it has “paused” users’ ability to generate videos of Martin Luther King Jr. on its artificial intelligence video tool Sora, following backlash over “disrespectful depictions.” “While there are strong free speech interests in depicting historical figures, OpenAI believes public figures and their families should ultimately have control over how their likeness is used,” the company said in a Thursday statement posted on X. “Authorized representatives or estate owners can request that their likeness not be used in Sora cameos.” The change comes a few weeks after the launch of Sora 2, which lets users make realistic-looking AI-generated videos using real and historical people. Critics charge that it’s contributing to an era of misinformation and “AI slop” that is blurring the lines between what’s real and what’s fake. The product has also generated online discussion about ethics around the use of this technology. Some creators were using King’s likeness for inappropriate purposes. Users recently recreated the late actor Robin Williams in AI videos, prompting his daughter Zelda to call them “disturbing.”",
    "category": "technology",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-10-17",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-496558598.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 24,
    "title": "Instagram will soon let parents stop teens from chatting with AI characters",
    "description": "Instagram will launch new safety features for teens, including the ability for parents to prevent their kids from chatting with the platform’s AI characters, parent-company Meta announced Friday. It’s one of several new safety features from Meta and OpenAI meant to combat growing concerns about how AI could impact teens’ mental health. Parents will be able to either turn off teens’ access to individual chats with AI characters or just block access to specific characters, the social media giant said in a blog post. The app will also show parents information about the topics teens are discussing with AI characters. The company said it’s building the controls now and users will start seeing them early next year. The move comes after Meta and the tech industry more broadly have grappled with criticisms from parents and lawmakers that online platforms aren’t doing enough to protect children online. Concerns have also been raised about whether people are relying on AI for emotional support and companionship. A wave of reports this year have indicated that some people have endured emotional distress and isolated themselves from family members after developing close relationships with chatbots like ChatGPT. Multiple lawsuits have been filed against the company behind Character.AI, another popular app for chatting with AI personas, over allegations that the platform played a role in self-harm and suicide in teens. A lawsuit was also filed against OpenAI in August over allegations that ChatGPT contributed to the suicide of 16-year-old Adam Raine. And a Wall Street Journal investigation from April found that Meta’s chatbot and other AI chatbots on its platforms would engage in sexual conversations even with accounts identifying as minors. Meta said its AI characters “are designed not to engage” in conversations with teens about “self-harm, suicide, or disordered eating” or topics that “encourage, promote or enable” those subjects. Teens are also only able to chat with certain AI characters related to content like education and sports, the blog post said. Instagram’s new parental controls follow other updates the company has recently made to better protect teens. Earlier this week it adjusted its “Teen Accounts” settings to line up with PG-13 ratings, meaning it won’t show or promote posts featuring strong language or those that could promote “harmful behaviors.” In late September, OpenAI announced parental controls for ChatGPT that reduce “graphic content, viral challenges, sexual, romantic or violent roleplay, and extreme beauty ideals.”",
    "category": "technology",
    "author": "Ivan Zahorui",
    "publishedDate": "2025-10-17",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1482848852.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 25,
    "title": "Microsoft AI CEO: We’re making an AI that you can trust your kids to use",
    "description": "Popular artificial intelligence chatbots like ChatGPT and Meta AI are increasingly blurring the line between real-world and digital relationships by allowing romantic and sometimes sexual conversations — while scrambling to make sure children aren’t accessing that adult content. But Microsoft wants no part of that, the company’s AI CEO Mustafa Suleyman told CNN. “We are creating AIs that are emotionally intelligent, that are kind and supportive, but that are fundamentally trustworthy,” Suleyman said. “I want to make an AI that you trust your kids to use, and that means it needs to be boundaried and safe.” Microsoft is locked in a race with tech giants like OpenAI, Meta and Google to make its Copilot the AI tool of choice in what Silicon Valley believes will be the next big computing wave. Copilot now has 100 million monthly active users across Microsoft’s platforms, the company said in its most recent earnings call. That’s well below competitors like OpenAI, whose ChatGPT has 800 million monthly active users. But Microsoft is betting its approach will win it a wider audience, especially as AI companies grapple with how to shape their chatbot’s personalities amid reports of AI contributing to users’ mental health crises. “We must build AI for people; not to be a digital person,” Suleyman wrote in a blog post earlier this year. The interview came ahead of a series of new Copilot features that Microsoft unveiled on Thursday, which include the ability to refer back to previous chats, engage in group conversations, improved responses to health questions and an optional, sassy tone called “real talk.”",
    "category": "technology",
    "author": "Oliver Caffrey",
    "publishedDate": "2025-10-23",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2207864228.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 26,
    "title": "Their history is just erased’: Google drops a key program for boosting women in tech",
    "description": "The email that said the career resource program for women would no longer be part of Google was terse and followed months of eroding support. But the deletion of years of Women Techmakers’ work came as a significant shock to its members. “Everything that I ever hosted and facilitated for Women Techmakers is gone. And there are just as many ambassadors who were in the community that put in so much effort to be part of this, (and) their history just erased,” Sherry Yang, an engineering manager in Canada and an ambassador for the group, told CNN. Google earlier this month offloaded the key career resource program for supporting women in tech and severed its integration within the company. The decision was communicated to members in a short email with little explanation earlier this month. It left members feeling surprised, upset and sidelined as the company removed years’ worth of content and videos they created. The end of Women Techmakers served as another sign the search giant is unwinding its diversity programs as such initiatives face increasing political pressure. Google announced an external organization called Technovation will take over the group, but members of Women Techmakers told CNN they feel they have lost an important direct association and pipeline with one of the world’s most influential technology companies. “The message it sends to women in tech, and really women in general, is that we cannot count on unwavering support from big corporations,” Vassiliki Dalakiari, a former Women Techmakers ambassador and AI research and development manager in Greece, told CNN. “We need to keep speaking up until we are heard. Google helped to do that, and they decided to quietly turn their back on us.” Google declined to comment. A person with knowledge of the program said that Google is supporting and providing funding to Technovation through the transition phase and that the company believes in Technovation’s “ability to execute impactful, global programs.” Technovation CEO Tara Chklovski told CNN that the organization is getting funding from Google “to provide deeper programmatic support” to Women Techmaker members. The group will still have access to events, programs and “technology leaders from multinational companies from around the world (in addition to Google),” she said. But the members say they feel tossed aside by Google after years of building a community many said helped them in their career and personally, as they forged their careers in a male-dominated industry.",
    "category": "technology",
    "author": "Peter Larsen",
    "publishedDate": "2025-10-23",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2166180687.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 27,
    "title": "The battle for the future of the internet is underway",
    "description": "The tug-of-war over the internet’s future escalated dramatically on Tuesday after OpenAI unveiled a new product that takes direct aim at the heart of Google’s core business: controlling the world’s front door to the internet. OpenAI this week released ChatGPT Atlas, a desktop web browser infused with the popular AI chatbot. The product is more than just a way to expand ChatGPT, which now has more than 800 million weekly users. It’s an attempt to become the pathway to websites, social media and other online services, giving it a more direct role in everything people do online. Google has dominated that business for two decades. OpenAI is betting it can start to take over. OpenAI’s ChatGPT Atlas isn’t the first and only AI-driven web browser; AI search company Perplexity launched its Comet browser in July. Yet ChatGPT’s massive reach makes it the most formidable threat to Google, marking a turning point in the transition away from lists of blue links. “Your browser is where all of your work, tools, and context come together,” OpenAI CEO Sam Altman said in a blog post announcing Atlas. “A browser built with ChatGPT takes us closer to a true super-assistant that understands your world and helps you achieve your goals.” Google’s search engine – which is at the core of its Chrome browser – isn’t going away anytime soon. But there’s some data to suggest consumers are indeed embracing AI for some of the tasks they may have previously relied on search links for. A study from Pew Research found that people are less likely to click on links when AI-generated summaries are displayed in Google. And Apple’s senior vice president of services said earlier this year in court testimony, per Bloomberg, that search queries on its devices declined for the first time in April. The launch of Atlas, and whether it’s successful, will test whether consumers are truly ready to make a more dramatic shift to AI for their daily needs. For Google’s web browser and search engine, the move toward AI and away from links has been gradually built over the course of a decade. OpenAI’s Atlas, however, puts ChatGPT at the center of the browsing experience right from the jump. It’s ChatGPT’s search bar, not Google’s, that greets you upon opening the browser, along with suggestions for topics to research or tasks for ChatGPT’s AI agents to handle, like planning a weekend trip. A button at the top of the page pulls up ChatGPT in a sidebar, where users can ask questions or have it summarize the page. (I asked ChatGPT, for example, to explain the difference between “earnings” and “adjusted earnings” just by highlighting the text in an article and typing ‘what’s this?’). Then there’s ChatGPT’s agent mode, which can handle tasks on your behalf. When I asked it to find a bar in New York City’s Long Island City neighborhood with cheap drinks near the 7 subway and to book a table for three people, ChatGPT suggested a cocktail bar with happy hour deals located right near the train’s Queensboro Plaza stop. It also asked what time I’d like to book the reservation for.",
    "category": "sport",
    "author": "Peter Larsen",
    "publishedDate": "2025-10-22",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2242190580.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 28,
    "title": "You thought Monday’s internet outage was bad? Just wait",
    "description": "Monday’s Amazon Web Services outage — and the global disruption it caused — underscored just how reliant the internet has become on a small number of core infrastructure providers. The ramifications of such outages could only get worse if artificial intelligence becomes as central to work and daily life as tech giants suggest it will in the coming years. Monday’s outage briefly blocked some people from scheduling doctor’s appointments and accessing banking services. But what if an outage took down the AI tools that doctors were using to help diagnose patients, or that companies used to help facilitate financial transactions? It may be a hypothetical scenario today, but the tech industry is promising a rapid shift toward AI “agents” doing more work on behalf of humans in the near future – and that could make businesses, schools, hospitals and financial institutions even more reliant on cloud-based services. A global survey of nearly 1,500 firms published by McKinsey & Company in May found that 78% of respondents already use AI in at least one business function, up 55% from a year earlier. “If there’s an outage and you rely on AI to make your decisions and you can’t access it, that’s going to have an effect on performance,” said Tim DeStefano, associate research professor at Georgetown’s McDonough School of Business.",
    "category": "technology",
    "author": "Peter Larsen",
    "publishedDate": "2025-10-22",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213966204.jpg?c=original&q=w_860,c_fill/f_avif"
  },
  {
    "id": 29,
    "title": "Samsung’s big answer to the Apple Vision Pro is here. I got to try it",
    "description": "You can already use Google Maps to virtually “explore” a city on the other side of the world without leaving your seat. But what if you could take that a step further by feeling like you’re inside the map? And what if you could learn about the restaurant on the corner or a landmark in the distance just by looking at it and asking? That ability to view apps on a much larger virtual screen and talk with a digital assistant that can see what you’re seeing is one of the touted features of the Galaxy XR, Samsung’s new mixed reality headset, which launched October 21 for $1,800. Samsung is one of many tech companies that have tried to make virtual and augmented reality headsets as pervasive as smartphones and laptops, although such devices are still a niche primarily appealing to early adopters, tech enthusiasts and gamers. That includes Apple’s $3,500 Vision Pro headset, which has struggled to attract developers and resonate with buyers, according to reports from The Wall Street Journal and Bloomberg. Both Apple’s and Samsung’s devices seek to establish a new type of headset that offers different levels of immersion, from virtual screens to digital environments that fully envelop a user’s field of view.",
    "category": "technology",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-22",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/samsunggalaxyxr.jpg?c=16x9&q=w_860,c_fill/f_webp"
  },
  {
    "id": 30,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "It took a day without Amazon Web Services for Americans to realize how reliant the internet is on a single company. It’s not just that people couldn’t place mobile orders for coffee at Starbucks or ask Alexa for the weather. Hospitals said crucial communications services weren’t working, and teachers couldn’t access their planned lessons for the day. Chime, a mobile banking service, was down, too, leaving people without access to their money. Ring and Blink cameras, along with most smart home devices, stopped working. AWS is one of a small group of cloud computing juggernauts that form the backbone of the internet, providing businesses with backend computing tools needed to power crucial parts of their daily operations. That includes everything from storage to virtual servers that companies can use to develop and deploy apps without investing in their own hardware. While other cloud providers exist, they lack the scale and reach of Amazon, Microsoft and Google. These three power the majority of the world’s cloud services, around 60% of the market, Roy Illsley, chief analyst at Omdia, told CNN. But among those three, AWS is the largest with roughly 37% of the market, according to research firm Gartner. AWS has a customer base of 4 million, according to an HG Insights report published this year. So when a platform like AWS goes down, it has a cascading effect. One expert already estimated the total impact of the disruption will be in the billions of dollars. “It creates a very large single point of failure that then impacts operations at warehouses, deliveries, people being able to sell their goods and services on websites,” Jacob Bourne, an analyst at eMarketer, told CNN.",
    "category": "technology",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 31,
    "title": "US and China agree on trade framework ahead of leaders' meeting",
    "description": "'I think we have a very successful framework for the leaders to discuss on Thursday,' Bessent told reporters. Bessent told NBC's 'Meet the Press' that he anticipated the agreement would defer China's expanded export controls on rare earth minerals and magnets and avoid a new 100% U.S. tariff on Chinese goods threatened by Trump.He said Trump and Xi would discuss soybean and agricultural purchases from American farmers, more balanced trade and resolving the U.S. fentanyl crisis, which was the basis of 20% U.S. tariffs on Chinese goods.China's Li said both sides had reached a 'preliminary consensus' and will next go through their respective internal approval processes.'The U.S. position has been tough,' Li said. 'We have experienced very intense consultations and engaged in constructive exchanges in exploring solutions and arrangements to address these concerns.'Trump arrived in Malaysia on Sunday for a summit of the Association of Southeast Asian Nations, his first stop in a five-day Asia tour that is expected to culminate in a face-to-face with Xi in South Korea on October 30. After the talks, he struck a positive tone, saying: 'I think we’re going to have a deal with China'.",
    "category": "business",
    "author": "Sofia Collins",
    "publishedDate": "2025-10-26",
    "image": "https://www.reuters.com/resizer/v2/Q57Q67L6XVOUXJX3FHWMJYIRTE.jpg?auth=c55c4dab159771ae99f0f2293c361e8a5bbefb9bb88b3c861947e60c344ce015&width=960&quality=80"
  },
  {
    "id": 32,
    "title": "Volkswagen is ok on chip supply for now, CEO tells Bild am Sonntag",
    "description": "'In the short-term, we are provided for in the Volkswagen Group. We need a swift political solution.' China has banned exports of Nexperia's finished products in response to the Netherlands seizing control of the company, whose Chinese owner Wingtech (600745.SS), opens new tab has been flagged by the U.S. as a possible national security risk. The stand-off risks adding to woes for Europe's auto sector on top of U.S. tariffs and Chinese export curbs on rare earths. Blume currently also serves as CEO of Porsche (P911_p.DE), opens new tab, which has been thrown into what he called a 'massive crisis' due to plunging sales in China and U.S. import tariffs. As a result, Porsche on Friday disclosed a third-quarter operating loss of nearly 1 billion euros ($1.2 billion) and Blume said that there would be 'a clear positive trend' for the luxury sportscar maker from 2026. Porsche earlier this month said that Blume would pass on the CEO job to former McLaren Automotive CEO Michael Leiters at the start of 2026, following long-standing investor criticism that running two carmarkers was too much for one individual. 'Leiters was a candidate on my list of successors,' Blume said, adding he is a 'sports car professional' and that he would be a 'good Porsche boss'.",
    "category": "business",
    "author": "Sofia Collins",
    "publishedDate": "2025-10-26",
    "image": "https://www.reuters.com/resizer/v2/ZWEDMO5MVRKCJEGRTHLNC7CFNM.jpg?auth=81d98e3e95d2f5e71eeb00ca82cef624884573dd1e8b659e59110bec31a489cc&width=720&quality=80"
  },
  {
    "id": 33,
    "title": "Exxon sues California over climate disclosure laws",
    "description": "Exxon said the laws force it to adopt California’s preferred frameworks for climate reporting, which it views as misleading and counterproductive. The oil giant said it already reports emissions and climate risks voluntarily, and objects to California's frameworks. Democratic-ruled California has long had some of the strictest environmental rules in areas like vehicle fuel efficiency standards and planning policy, after passing a climate change law in 2006. California passed two laws in 2023 that would require companies to publicly report their greenhouse gas emissions and climate-related financial risks. The California laws were supported by several big companies including Apple (AAPL.O), opens new tab, Ikea and Microsoft (MSFT.O), opens new tab, but opposed by several major groups such as the American Farm Bureau Federation and the U.S. Chamber of Commerce, which called them 'onerous.' SB 253 requires public and private companies that are active in the state and generate revenue of more than $1 billion annually to publish an extensive account of their carbon emissions starting in 2026. The law requires the disclosure of both the companies' own emissions and indirect emissions by their suppliers and customers. SB 261 requires companies that operate in the state with over $500 million in revenue to disclose climate-related financial risks and strategies to mitigate risk. Exxon also argued that SB 261 conflicts with existing federal securities laws, which already regulate what publicly traded companies must disclose regarding financial and environmental risks. 'The First Amendment bars California from pursuing a policy of stigmatization by forcing Exxon Mobil to describe its non-California business activities using the State's preferred framing,' Exxon said in the lawsuit. The California Department of Justice and the California Air Resources Board did not immediately respond to a request for comment. Reporting by Chandni Shah in Bengaluru and Mike Scarcella in Washington, Editing by Deepa Babington and Matthew Lewis",
    "category": "business",
    "author": "Sofia Collins",
    "publishedDate": "2025-10-26",
    "image": "hhttps://www.reuters.com/resizer/v2/WR6YWDZERJP7DEMS46RNF3N4R4.jpg?auth=89412ab10aef5bff51093ce80b539d8a15996e09a05ae32b12ce545b2a059d9b&width=720&quality=80"
  },
  {
    "id": 34,
    "title": "Fed hands banks a win with vote to advance 'stress test' overhaul",
    "description": "Fed Vice Chair for Supervision Michelle Bowman, who is leading the effort as the central bank's top regulatory official, touted the effort as providing overdue transparency to the exercise, which helps set large bank capital levels each year. 'Since its inception, the Board's stress testing program has operated with limited transparency, unreasonable year-over-year volatility, and the absence of any meaningful appeals process,' she said in a prepared statement before the vote to advance the changes. 'This lack of transparency can lead to uncertainty for banks in capital planning, potential misalignment of capital requirements with actual risks, and limited public understanding and scrutiny of the stress testing process.' Banks have complained for years that the test should be more transparent and predictable, and several industry groups went so far as to sue the Fed late last year in an effort to try and compel those changes. The lawsuit was postponed after the central bank said it was already considering several of the changes sought by the industry. The groups, which include the Bank Policy Institute and the American Bankers Association, said in a statement following the Fed meeting that they may continue staying their litigation as the central bank further considers these changes. 'Today is not just a good day for the rule of law but also a good day for economic growth,' the groups said in a joint statement, adding that the unpredictability of prior tests forced banks to limit their activities. While the Fed board voted in favor of the proposal, Fed Governor Michael Barr, who previously led the Fed's rule-writing efforts during the Biden administration, strongly opposed the changes. In prepared remarks, Barr argued that making so much of the test public will render it 'weaker and less credible.' While the Fed said the disclosures should not affect bank capital, Barr said banks will soon be able to fine-tune their books to pass the test with the lowest possible capital requirements, which are meant to cushion against potential losses. 'I believe today's proposal will significantly weaken the stress test and, consequently, bank resilience,' he said.",
    "category": "business",
    "author": "Sofia Collins",
    "publishedDate": "2025-10-24",
    "image": "https://www.reuters.com/resizer/v2/3A2B5YC3RVKSHL2CXSXCPSOQTI.jpg?auth=b9ff7d860cede1a0385e08c213c50ed797a9387e736550cf2c76be6cbf7f95ae&width=720&quality=80"
  },
  {
    "id": 35,
    "title": "Blackstone to invest $705 million in India's Federal Bank to become largest shareholder",
    "description": "Dealmaking in Indian private banking space has picked up pace this year. Last week, Dubai-based bank Emirates NBD purchased a 60% stake in RBL Bank (RATB.NS), opens new tab for $3 billion. Japan’s Sumitomo Mitsui Banking Corporation bought a 20% stake in Yes Bank (YESB.NS), opens new tab in May and then an additional 4.2% in September. Blackstone will invest in Federal Bank through a Singapore-based affiliate that has entered a share-purchase agreement with the bank, which includes the right to nominate a non-executive director to its board. The deal will be executed through preferential equity shares and warrants, and is subject to approval from shareholders and the banking and competition regulators. Federal Bank's shareholders will meet in a so-called extraordinary general meeting on November 19 to approve the preferential share issue and board seat. Shares of lender rose 1.15% to 229.00 rupees in Mumbai. The bank, which has a loan book of 2.44 trillion rupees, posted a 9.6% decline in its net profit to 9.55 billion rupees for the September quarter due to a decline in treasury income and a rise in funds kept aside for bad loans.",
    "category": "business",
    "author": "Aria Evans",
    "publishedDate": "2025-10-24",
    "image": "https://www.reuters.com/resizer/v2/HHYP2BTOIRP7HH34RDCRL2Z6SQ.jpg?auth=56cf72ca47b7ae44e5067feaab84b7c416f712c45d06b8f9576cc0f89080a204&width=720&quality=80"
  },
  {
    "id": 36,
    "title": "Ringleader behind 'Russian-inspired' UK arson discussed kidnapping Revolut founder, court told",
    "description": "On the day he was arrested in April 2024, Earl communicated on Telegram with someone prosecutors said was a Wagner handler known as 'Lucky Strike', about the kidnap and extortion of Revolut's Russian-born billionaire boss Nikolay Storonsky. 'Can you catch somebody and get him to transfer money to your accounts,' Lucky Strike wrote on Telegram before attaching the Wikipedia entry for Storonsky, who co-founded Revolut in 2015. He is a billionaire so he will have a lot of security and systems to protect unauthorised payments,' Earl replied. 'But I will research more into this and see if it's possible.' In another exchange, Earl discussed burning down a warehouse in the Czech Republic for 35,000 pounds ($47,000) and sought to recruit someone living in Slovakia to do it, prosecutor Duncan Penny told the court. 'A warehouse needs to be (fire emoji),' Earl wrote. Asked about the size, he says: 'It's big.' The court was also shown messages from Earl to a serving British soldier, offering to pay him for 'intelligence'. The soldier, who said he had been in the British military for six years, said he could get information not only from his squadron 'but I have mates in the SAS', a reference to the Special Air Service, the army's special forces regiment. 'Overall, Earl's actions constitute a sustained campaign of terrorism and sabotage on UK soil, carried out in support of a foreign power - the Russian Federation - and its war of aggression against Ukraine,' Penny said. Earl's lawyer Paul Hynes told the court Earl was a 'sad individual' and a 'Walter Mitty' character, and that he had been groomed by 'sophisticated' Wagner handlers. The Kremlin has denied the accusations, and its embassy in London has rejected any part in the warehouse fires, which Penny said appeared to be part of a series of European-wide sabotage operations. Citing a British counter-terrorism police officer, he said 10 days after the London fire, warehouses belonging to the same company were set ablaze on an industrial estate in Madrid, which 'strongly suggests' the incidents were linked. Britain has repeatedly accused Moscow of orchestrating malign activity in Britain, with a group of Bulgarians convicted in March of spying on behalf of Russian intelligence. On Thursday, police said they had arrested three men suspected of assisting Russia's intelligence service and warned the public against what it said was a growing campaign by foreign intelligence services to recruit 'proxies' in Britain.",
    "category": "business",
    "author": "Joseph Edwardsi",
    "publishedDate": "2025-10-23",
    "image": "https://www.reuters.com/resizer/v2/TXQMXJOHMNKJPJI445TMBY4DCY.jpg?auth=fc6afec1b1a661cb67e6fa06906289fd1522403c5f1b4fdd0417dfb9884c3a27&width=720&quality=80"
  },
  {
    "id": 37,
    "title": "Top HSBC wealth executive Trista Sun to leave bank, memo says",
    "description": "The Reuters Daily Briefing newsletter provides all the news you need to start your day. Sign up here. A company spokesperson confirmed the contents of the memo. Sun did not immediately respond to a request for comment. She led the bank's International Wealth and Premier Banking business in China for three years until May, when she was relocated to Hong Kong from Shanghai, Reuters reported at the time, citing a memo. HSBC was reducing staff numbers at its China digital wealth business - called Pinnacle - by nearly half, or about 900 people, Reuters reported in February, citing two sources. The move was a sharp reversal of the bank's ambition for the unit, which was part of its expansion plans in the country. The downsizing came after HSBC launched probes in China in 2024 to examine Pinnacle's staff compensation structures and whether suppliers had inflated expenses, Reuters reported, citing sources close to the matter. Pinnacle, which debuted in 2020, enables HSBC to sell insurance and fund products through a digital platform in China. HSBC has vowed to pivot to Asia, with its wealth division as an area of particular focus, after it embarked upon a restructuring of its global presence last year. Sun's role won't be backfilled, according to the memo. O'Byrne said a team within the wealth division would take over the collaboration activities with which she drove cross-business revenue growth opportunities. Beginning in Hong Kong and working her way up to global chief operating officer of wealth management and global head of international and cross-border, roles based in London, Sun rose to the highest rank of wealth executives at HSBC within 10 years, according to her LinkedIn profile. Before relocating to Hong Kong in May, Sun was also executive vice president of HSBC China, according to the profile, making her the de-facto second most senior HSBC executive in the onshore market",
    "category": "business",
    "author": "Aria Evans",
    "publishedDate": "2025-10-24",
    "image": "https://www.reuters.com/resizer/v2/FLFH5FQRIZPPFLWELILNTHLOZY.jpg?auth=93141104f8d4578b5f6bef091a7d901deb22824d4855d44e97c47ffa56dc489a&width=960&quality=80"
  },
  {
    "id": 38,
    "title": "JP Morgan sees gold prices averaging $5,055 per ounce by late 2026",
    "description": "'Gold remains our highest conviction long for the year, and we see further upside as the market enters a Fed rate-cutting cycle,' Natasha Kaneva, Head of Global Commodities Strategy at JP Morgan, said. The combination of a 'Fed cutting cycle with overlays of stagflation anxiety, concerns around Fed independence, and broader debasement hedging' supports gold's upside, Gregory Shearer, Head of Base & Precious Metals Strategy said. On the dollar, the bank noted that the rally is 'not a de-dollarization or not a debasement story, but it is most likely a dollar diversification story,' highlighting that foreign holders of U.S. assets are gradually redirecting small allocations into gold. JP Morgan analysts also highlighted that recent market consolidation is healthy. The pullback reflects the market digesting the rapid price gains since August, said Kaneva. 'It's normal if you're paralyzed with fear, because the price moved so fast ... It's just a very clean story - you have a lot of buyers, and you have no sellers,' she said. She reiterated a long-term target of $6,000/oz by 2028, stressing that gold should be viewed on a multi-year horizon. Spot gold has achieved several record highs this year, with the latest peak of $4,381.21 hit on Monday, marking a significant year-to-date gain of nearly 57% and setting the stage for its strongest annual performance since 1979.",
    "category": "business",
    "author": "Joseph Edwards",
    "publishedDate": "2025-10-23",
    "image": "https://www.reuters.com/resizer/v2/IWLE27II5BLGDEE6PYC7AYRY2U.jpg?auth=b9c957a9e6edace31973d66c263e84d6c6396e199c3e7af496b0e3a2fec421e7&width=720&quality=80"
  },
  {
    "id": 39,
    "title": "Morning Bid: Oil jumps and Tesla skids",
    "description": "Oil prices jumped 4% on a wave of new retaliatory sanctions on Russian crude over Moscow's repeated bombardment of Ukraine, adding to fresh trade and inflation anxiety on Wall Street just as megacap Tesla tumbled overnight on a big profits miss. U.S. President Donald Trump hit Russia's two biggest oil companies, Rosneft and Lukoil, with the sanctions in a turnaround that also saw him cancel a meeting with Russian counterpart Vladimir Putin. Although still down 15% year-on-year, U.S. crude jumped above $60 per barrel to two week highs. Former Russian President Dmitry Medvedev said the latest Trump moves over Ukraine were 'an act of war against Russia.' Britain sanctioned Rosneft and Lukoil last week. Separately, EU countries approved a 19th package of sanctions against Russia for the war that includes a ban on imports of Russian LNG. And the move came as industry sources told Reuters Indian refiners were poised to sharply curtail imports of Russian oil to ensure they were in compliance with U.S. sanctions. New Delhi is under pressure from stiff U.S. trade tariffs over the issue. The energy jolt comes as Wall Street awaits the September U.S. inflation report tomorrow and pushed up Treasury yields despite a decent 20-year bond auction on Wednesday. The dollar firmed too, with the yen hitting its weakest since October 10. Gold regained some of its poise after steep losses earlier in the week.Hit by a 10% earnings-day drop in Netflix and a 6% drop in chipmaker Texas Instruments, the S&P500 lost 0.5% on Wednesday as U.S.-China trade tensions heated up once again. Tesla's 4% stock drop overnight adds to the jitters after the electric car giant's fourth consecutive profit miss and Wall Street index futures failed to rebound ahead of Thursday's bell. Intel tops Thursday's heavy earnings diary. The China trade worries jangled more broadly. According to a Reuters report, the Trump administration is considering a plan to curb an array of software-powered exports to China to retaliate against Beijing's latest round of rare earth export restrictions. Trump said the long-awaited meeting with Chinese leader Xi Jinping may now not happen as the November 1 deadline for more severe U.S. tariffs looms. The Philadelphia Semiconductor index tumbled 2.4%. Trump's cabinet secretaries view China's move on rare earths as 'full-blown economic war', a person familiar with administration thinking told Reuters. 'The prospect for escalation is severe.' China's ruling Communist Party Central Committee, meanwhile, released a communique on its latest five-year plan, emphasizing a strong domestic market and an expansion of domestic demand. Elsewhere, markets were more mixed as global political and trade issues jostled with waves of corporate earnings. China's stocks advanced, but Japan's Nikkei fell back more than 1%. In today's column, I take a look at how Europe navigates the trade crosswinds from both Washington and Beijing. Today's Market Minute * The United States hit Russia's major oil companies with sanctions on Wednesday and accused the Russians of a lack of commitment toward ending the war in Ukraine, as Moscow conducted a major training exercise involving nuclear arms. * Just a month after U.S. President Donald Trump hailed 'progress' in talks with China, the world's two most powerful nations are scrambling to salvage a planned summit of their leaders, now just a week away, while trading blame for a spike in tension. * The Trump administration is considering a plan to curb a dizzying array of software-powered exports to China, from laptops to jet engines, to retaliate against Beijing's latest round of rare earth export restrictions, according to a U.S. official and three people briefed by U.S. authorities. * Critical minerals, and especially rare earths, as well as the ongoing need to decarbonise and a bigger role for governments are the three top areas of concern for the global mining industry. Read the latest from ROI Asia Commodities Columnist Clyde Russell.",
    "category": "business",
    "author": "Joseph Edwards",
    "publishedDate": "2025-10-21",
    "image": "https://www.reuters.com/resizer/v2/BVSZIHLZJJM4XH7W7JMA3VA5G4.jpg?auth=6caa7a7cc273a8f614de5d18348ca40d5b767f81ae4400a122daf41005159139&width=720&quality=80"
  },
  {
    "id": 40,
    "title": "Morning Bid: Gold recoils and Netflix disappoints",
    "description": "Gold's stellar climb this year has hit the buffers and streaming giant Netflix disappointed Wall Street with its latest earnings, stopping stock markets in their tracks as trade and geopolitical jitters mounted again.Despite being on course for the best year since 1979 and with no ostensible trigger, gold prices turned tail on Tuesday and plunged 5% - the biggest one-day drop in five years. The recoil extended on Wednesday, bringing it close to breaking back below $4,000 per ounce before steadying. The size of the gold drop suggested that speculative fervor has driven the latest run-up as much as safe-haven demand and a firmer dollar - largely driven by the yen's fall on reports of another big Japanese fiscal boost.With the S&P500 stalling on Tuesday and futures flat ahead of today's bell, Netflix fumbled overnight - dropping almost 6% in out of hours trading after its third-quarter update missed targets on a Brazilian tax dispute. Netflix had risen 39% this year up to that release. Tesla and IBM and a host of other big names are due out later, with the overall U.S. earnings season so far marginally ahead of expectations and tracking 9% annual profit growth. With Friday's U.S. inflation report and Wednesday's 20-year Treasury bond auction on the radar, the long-bond yield eked out another 6-month low.British government bonds were one of the big market movers in Europe and 10-year gilt yields hit their lowest since April after UK September inflation unexpectedly held steady at 3.8% - encouraging bets on another Bank of England rate cut this year. Sterling slipped back against the dollar and euro.Barclays stock jumped 5% after it announced a surprise share buyback and upgraded a key profitability target for the year.Meantime, hopes for an end to the Washington shutdown this week were knocked back somewhat- as was speculation of separate meetings soon between President Donald Trump and both China's leader Xi Jinping and Russian President Vladimir Putin over the U.S.-China trade standoff and Ukraine war, respectively.In today's column, I take a look at Friday's U.S. inflation report and how the U.S. has likely moved into an above-target inflation regime - whatever you think about the tariff impact. Today's Market Minute* A planned summit between U.S. President Donald Trump and Russian President Vladimir Putin was put on hold on Tuesday, as Moscow's rejection of an immediate ceasefire in Ukraine cast a cloud over attempts at negotiations.* Japan's new Prime Minister Sanae Takaichi is preparing an economic stimulus package that is likely to exceed last year's $92 billion to help households tackle inflation, government sources familiar with the plan said on Wednesday.* British inflation and a key underlying measure of price growth both unexpectedly held steady in September, official figures showed on Wednesday, offering some relief to finance minister Rachel Reeves ahead of her November budget.* Global oil prices are signalling that the market is tipping into a protracted period of oversupply, but the huge disparity in forecasts for OPEC’s production will likely limit the selloff, argues ROI energy columnist Ron Bousso.* Is the U.S. equity market near the peak scaled in the lead-up to the dotcom bubble? Comparing current pricing with the late 1990s indicates that – far from reaching a summit – U.S. equities may only be at 'base camp', argues Stephen Jen, CEO of Eurizon SLJ asset management, in his latest piece for ROI.",
    "category": "business",
    "author": "Joseph Edwards",
    "publishedDate": "2025-10-21",
    "image": "https://www.reuters.com/resizer/v2/IBXR7A2CEBIKLOHUBWVUHAEVS4.jpg?auth=217083f6fc266fd387146ee797e7df771016199a0b46fb062852cc86bd41bc49&width=720&quality=80"
  },
  {
    "id": 41,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-22",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 42,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 43,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 44,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 45,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 46,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 47,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 48,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 49,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  },
  {
    "id": 50,
    "title": "Amazon’s global outage exposes major vulnerabilities to American life",
    "description": "",
    "category": "business",
    "author": "Steve Tyminski",
    "publishedDate": "2025-10-21",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210697751-20251021130429988.jpg?c=original&q=w_1202,c_fill/f_avif"
  }
]
